package Summarize.note;

public class IntroductionToTheNotes {
    /*注解：
    *   概念：说明程序的，给计算机看的
    *   注释：用文字描述程序，给程序员看的
    *   定义：注解（Annotation），也叫元数据，一种代码级别的说明，他是jdk1.5之后版本引入的一个特性，与类，接口，枚举是在同一个层次
    *       他可以申明在包，类，字段，方法，局部变量，方法参数等的前面，用来对这些元素进行说明，注释
    *   作用分类
    *       1、百年写文档：通过代码里的标识的注解生成文档（生成文档，doc文档）（Javadoc 文件名）控制台
    *       2、代码分析：通过代码里标识的注解对代码进行分析（使用反射）
    *       3、编译检查：通过代码里标识的注解让编译器能够多实现基本的编译检查（override）
    *   概念描述：JDK1.5之后的新特性，说明程序的
    *   使用注解 ： @注解名称
    * JDK中预编译的注解
    *   1、Override:检查被该注解标注的方法是否继承自父类（接口）
    *   2、Deprecated：将该注解标注的内容表示已过时
    *   3、SuppressWamings：压制警告一般传递参数all @SupperssWamings("all")s*/
}
