package Summarize.JavaWeb.Concepts;

public class JavaWebConcepts {
    /*Web相关概念回顾
    *   1.软件架构：
    *       1.C/S:客户端/服务器端
    *       2.B/S:浏览器/服务器端
    *   2.资源分类
    *       1.静态资源：所有用户访问后，得到的结果都是一样的，静态资源可以直接被浏览器接收。如：Html。JavaScript，css
    *       2，动态资源：每个用户访问相同的资源收，得到的结果可能不一样，称为动态资源。动态资源被访问后，需要先转化为静态资源，
    *           返回给浏览器如：Servlet/Jsp/php/asp...
    *   3.网络通信三要素：
    *       1.IP:电子设备（计算机）在网络中唯一标记
    *       2.端口：应用程序在计算机唯一标识。如：0-65536
    *       3.传输协议：规定了数据传输的规则
    *           1.TCP：安全协议，三次握手，数度稍慢
    *           2.UDP：不安全协议，速度快。*/
}
